In [3]:
import pandas as pd
nba=pd.read_csv("nbasalaries.csv")
nba

,Unnamed: 0,RK,Player,TEAM,SALARY
0,0,1,Kobe Bryant,Los Angeles Lakers,"$25,000,000"
1,1,2,LeBron James,Cleveland Cavaliers,"$22,970,500"
2,2,3,Carmelo Anthony,New York Knicks,"$22,875,000"
3,3,4,Dwight Howard,Houston Rockets,"$22,359,364"
4,4,5,Chris Bosh,Miami Heat,"$22,192,730"
...,...,...,...,...,...
415,415,416,Orlando Johnson,Phoenix Suns,"$55,722"
416,416,417,Phil Pressey,Phoenix Suns,"$55,722"
417,417,418,Elliot Williams,Memphis Grizzlies,"$55,722"
418,418,419,Cory Jefferson,Phoenix Suns,"$49,709"
419,419,420,Thanasis Antetokounmpo,New York Knicks,"$30,888"

In [5]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420 entries, 0 to 419
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  420 non-null    int64
 1   RK          420 non-null    int64
 2   Player      420 non-null    object
 3   TEAM        420 non-null    object
 4   SALARY      420 non-null    object
dtypes: int64(2), object(3)
memory usage: 11.5+ KB

In [11]:
nba.head()

   Unnamed: 0  RK           Player                 TEAM        SALARY
0           0   1      Kobe Bryant   Los Angeles Lakers  $25,000,000
1           1   2     LeBron James  Cleveland Cavaliers  $22,970,500
2           2   3  Carmelo Anthony      New York Knicks  $22,875,000
3           3   4    Dwight Howard      Houston Rockets  $22,359,364
4           4   5       Chris Bosh           Miami Heat  $22,192,730

In [20]:
nba.columns

Index(['Unnamed: 0', 'RK', 'Player', 'TEAM', 'SALARY'], dtype='object')

In [21]:
nba.dtypes

Unnamed: 0     int64
RK             int64
Player        object
TEAM          object
SALARY        object
dtype: object

AttributeError: 'DataFrame' object has no attribute 'get_dtype_counts'